import React from 'react';
import aboutImg from '../assets/about.jpg'
import { TypeAnimation } from 'react-type-animation';

const About = () => {
    return (
        <div className='text-white max-w-[1200px] mx-auto my-12' id='about'>
            <div className='md:grid md:grid-cols-2 sm:py-16'>

            <div className='mt-4 md:mt-0 text-left flex '>
                <div className='my-auto mx-6'>
               <h2 className='text-4xl font-bold mb-4 primary-color'>
                <TypeAnimation
                        sequence={[
                            "আমার পরিচয় ও স্বপ্ন",
                            1000,   
                            "About Me",
                            1000,   
                        ]}
                        wrapper='span'
                        speed={50}
                        repeat={Infinity}
                    />
                    </h2>
                    {/* <h2 className='text-4xl font-bold mb-4 primary-color'>About Me</h2> */}
                    <p className='text-base lg:text-lg'>
আমি "সাবিহা তাবাসসুম"। আমি আমার বাবা-মায়ের একমাত্র সন্তান। আমার বাবা সুলাইমান এবং মা আফরুজা রুমা। আল্লাহর অশেষ রহমতে আমি এই পৃথিবীতে আগমন করেছি ১৯ জানুয়ারি ২০২৫ ইং (রবিবার) রাত ৮:২০ মিনিটে, যা ইসলামিক ক্যালেন্ডার অনুযায়ী ১৯ রজব ১৪৪৬ হিজরি এবং বাংলা ক্যালেন্ডার অনুযায়ী ৫ মাঘ ১৪৩১ বঙ্গাব্দ। আমার জন্মস্থান ময়মনসিংহের ট্রমা সেন্টার, যেখানে আমার জন্ম হয় বিশিষ্ট চিকিৎসক ডা. কাওসার নিগার মায়ার মেম এর তত্ত্বাবধানে।

আমার জন্মের প্রথম মুহূর্ত থেকেই আমি আমার পরিবারে আনন্দের বার্তা নিয়ে আসি। আমাকে প্রথম দেখার সৌভাগ্য হয়েছিল আমার আব্বুর। এরপর আমাকে প্রথম কোলে নিয়েছেন আমার দাদু। পরিবারের সবাই আমাকে পেয়ে অত্যন্ত আনন্দিত হয়েছিল। বিশেষ করে আমার আব্বু যখন আমাকে কোলে নেন, তখন তিনি আনন্দের বহিঃপ্রকাশ হিসেবে আমাকে ৫০০ টাকা উপহার দেন। এই মুহূর্তটি আমার পরিবারের জন্য অত্যন্ত স্মরণীয় ও আবেগপূর্ণ ছিল।

আমার স্বপ্ন

আমি বিশ্বাস করি, প্রতিটি মানুষই এই পৃথিবীতে একটি বিশেষ উদ্দেশ্য নিয়ে জন্মায়। আমিও আমার জীবনের লক্ষ্য ও স্বপ্ন ঠিক করে নিয়েছি। আমি বড় হয়ে দ্বীনি জ্ঞানের পাশাপাশি একজন চিকিৎসক হতে চাই। ইসলামের সঠিক জ্ঞান অর্জন করে সেটাকে মানুষের কল্যাণে কাজে লাগাতে চাই। একই সঙ্গে একজন দক্ষ ও সেবামূলক মনোভাবসম্পন্ন ডাক্তার হয়ে মানবতার সেবা করতে চাই। আমি চাই, আমার মাধ্যমে মানুষ উপকৃত হোক, অসুস্থদের সেবা করতে পারি, আর আল্লাহর সন্তুষ্টির জন্য মানবতার কল্যাণে নিজেকে উৎসর্গ করতে পারি।

আমার স্বপ্ন শুধু আমার ব্যক্তিগত উন্নতির জন্য নয়, বরং আমি চাই, ইসলামিক জ্ঞানের আলোয় নিজেকে আলোকিত করে সমাজে একটি ইতিবাচক পরিবর্তন আনতে। আমি চাই, আমার শিক্ষা ও চিকিৎসাসেবা মানুষের দুঃখ-কষ্ট লাঘবে কাজে আসুক। আমি আল্লাহর উপর ভরসা রেখে, মা-বাবার দোয়া সঙ্গে নিয়ে এবং একনিষ্ঠ পরিশ্রমের মাধ্যমে আমার স্বপ্ন বাস্তবায়ন করতে চাই।

আমার জীবনযাত্রা, আমার আদর্শ, এবং আমার শিক্ষা যেন সবসময় ইসলামের পথে পরিচালিত হয়—এই প্রার্থনাই করছি মহান আল্লাহর দরবারে। আমার এই স্বপ্ন পূরণে আমি নিরলস পরিশ্রম করব এবং একদিন ইনশাআল্লাহ আমার লক্ষ্য অর্জন করব।
                    </p>
                </div>
            </div>
                <img src={aboutImg} alt="img no saport" width={300} height={300} className='mx-auto rounded-3xl py-8 md:py-0' />

            </div>
        </div>
    );
};

export default About;